driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/MultiOpSameMsgElemElemDiffActRPC_Operation2_Invoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        xmlns:tns="http://seebeyond.com/Echo/" 
        xmlns="http://new.webservice.namespace"> 
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body> 
        <operation2>
            <body>
                <Elem1>
                    <Field1_1>A Test string for operation2</Field1_1>
                    <Field1_2>1234</Field1_2>
                    <Field1_3>This should get replaced.</Field1_3>
                </Elem1>
            </body>
        </operation2>
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope>